app/Helpers/Periodo_helper.php

SELECT `periodo`
FROM `periodo_letivo`
WHERE `ativo` = 1
 LIMIT 1
---
    function getPeriodoAtivo()
    {
        $model = new PeriodoLetivoModel();
        return $model->select('periodo')->where('ativo', 1)->first()['periodo'] ?? null;