app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `disciplina`
SELECT COUNT(*) AS `numrows` FROM `sala`
SELECT COUNT(*) AS `numrows` FROM `turma`
---
    public function totalRegistros()
    {

        $totalDisciplinas = $this->disciplinaModel->countAll();
        $totalUsuarios = $this->usuarioModel->countAll();
        $totalSalas = $this->salaModel->countAll();
        $totalTurmas = $this->turmaModel->countAll();