app/Controllers/Home.php

    public function listarTodasTabelas(){

        $data['disciplinas'] = $this->disciplinaModel->findAll();
        $data['usuarios'] = $this->usuarioModel->findAll();
        $data['salas'] = $this->salaModel->findAll();
        $data['turmas'] = $this->turmaModel->findAll();
---
SELECT *
FROM `disciplina`
SELECT *
FROM `usuario`
SELECT *
FROM `sala`
SELECT *
FROM `turma`