app/Controllers/HorarioAula.php

    public function verificarPeriodoAtivo()
    {

        // Busca o período letivo onde 'ativo' é 1
        $periodo = $this->periodoLetivoModel->where('ativo', 1)->first();
---
SELECT *
FROM `periodo_letivo`
WHERE `ativo` = 1
 LIMIT 1

    public function horarioAula()
    {
        $data['disciplinas'] = $this->disciplinaModel->findAll();
        $data['salas'] = $this->salaModel->findAll();
---
SELECT *
FROM `disciplina`
SELECT *
FROM `sala`

    public function horarioSala()
    {
        $data['salas'] = $this->salaModel->findAll();
---
SELECT *
FROM `sala`

    public function editarHorarioAula($codigoTurma)
    {
        $data['disciplinas'] = $this->disciplinaModel->findAll();
        $data['salas'] = $this->salaModel->findAll();
        $data['turmas'] = $this->turmaModel->where('codigo_turma', $codigoTurma)->findAll();
        $data['professores'] = $this->buscarProfessores();
        $data['editando'] = $data['turmas'][0]['codigo_turma'];
        $idHorarioAula = $this->horarioAulaModel->distinct()->where('codigo_turma', $codigoTurma)->findColumn('id_horario_aula');
        $data['idHorarioAula'] = $idHorarioAula[0];
        $data['periodoLetivo'] = $this->horarioAulaModel->distinct()->where('codigo_turma', $codigoTurma)->findColumn('periodo_letivo');
---
SELECT *
FROM `disciplina`
SELECT *
FROM `sala`
SELECT *
FROM `turma`
WHERE `codigo_turma` = 'TI-19'
SELECT DISTINCT `id_horario_aula`
FROM `horario_aula`
WHERE `codigo_turma` = 'TI-19'
SELECT DISTINCT `periodo_letivo`
FROM `horario_aula`
WHERE `codigo_turma` = 'TI-19'

    public function carregarHorarios($codigoTurma)
    {
        // Pesquisa os horários da turma apenas no período letivo ativo
        $pesquisaHorarios = $this->horarioAulaModel
            ->where('codigo_turma', $codigoTurma)
            ->where('periodo_letivo', $this->verificarPeriodoAtivo())
            ->findAll();

        $horarios = [];

        // Itera sobre os dados para formatar os eventos
        foreach ($pesquisaHorarios as $horario) {

            $disciplina = $this->disciplinaModel->find($horario['id_disciplina']);
            $professor = $this->buscarProfessor($horario['professor']);
            $sala = $this->salaModel->find($horario['id_sala']);
---
SELECT *
FROM `disciplina`
WHERE `disciplina`.`id_disciplina` = '2'
SELECT *
FROM `sala`
WHERE `sala`.`id_sala` = '3'