app/Controllers/HorarioAula.php

SELECT *
FROM `users`
WHERE `id` IN (SELECT `user_id` FROM `auth_groups_users` WHERE `group` = 'professor')
AND `users`.`deleted_at` IS NULL
---
    public function buscarProfessor($idProfessor)
    {
        //retorna todos os professores
        $dadosProfessor = $this->usuarioModel->findById($idProfessor);

        // Inicializa o array de usuários
        $professor = [
            'id_usuario' => $dadosProfessor->id, // ID do usuário.
            'nome' => $dadosProfessor->username, // Nome de usuário.
            'data_cadastro' => $dadosProfessor->created_at->toDateTimeString(), // Data de cadastro formatada como string.
            'tipo_usuario' => $dadosProfessor->group, // Grupo ao qual o usuário pertence.
            'email' => $dadosProfessor->secret, // E-mail ou credencial armazenada em auth_identities.
        ];

SELECT *
FROM `usuario`
WHERE `tipo_usuario` = 'professor'
---
    public function buscarProfessores()
    {

        //retorna todos os professores
        $dadosProfessores = $this->usuarioModel->whereIn('id', function ($query) {
            $query->select('user_id')
                ->from('auth_groups_users')
                ->where('group', 'professor');
        })
            ->orderBy('username', 'ASC') // Adicionando ordenação pelo nome
            ->findAll();

        // Inicializa o array de usuários
        $professores = [];

        // Itera sobre os resultados para formatar os dados antes de passar para a view.
        foreach ($dadosProfessores as $dadosProfessor) {
            $professores[] = [
                'id_usuario' => $dadosProfessor->id, // ID do usuário.
                'nome' => $dadosProfessor->username, // Nome de usuário.
                'data_cadastro' => $dadosProfessor->created_at->toDateTimeString(), // Data de cadastro formatada como string.
                'tipo_usuario' => $dadosProfessor->group, // Grupo ao qual o usuário pertence.
                'email' => $dadosProfessor->secret, // E-mail ou credencial armazenada em auth_identities.
            ];

SELECT DISTINCT `horario_aula`.*, `turma`.*
FROM `horario_aula`
JOIN `turma` ON `turma`.`codigo_turma` = `horario_aula`.`codigo_turma`
WHERE `horario_aula`.`periodo_letivo` = '25.1'
GROUP BY `horario_aula`.`id_horario_aula`
---
    public function listaHorarioAula()
    {
        // Obtém o período letivo ativo
        $periodoAtivo = $this->periodoLetivoModel->verificarPeriodoAtivo();

        // Obtém os dados de horários de aula e as informações relacionadas às turmas, eliminando duplicatas
        $data['horarios_aulas'] = $this->horarioAulaModel
            ->distinct()
            ->select('horario_aula.*, turma.*')
            ->join('turma', 'turma.codigo_turma = horario_aula.codigo_turma')
            ->where('horario_aula.periodo_letivo', $periodoAtivo)
            ->groupBy('horario_aula.id_horario_aula')
            ->findAll();

SELECT *
FROM `periodo_letivo`
WHERE `ativo` = 1
 LIMIT 1
---
    public function horarioAula()
    {
        $data['disciplinas'] = $this->disciplinaModel->orderBy('nome_disciplina', 'ASC')->findAll();
        $data['salas'] = $this->salaModel->orderBy('nome_sala', 'ASC')->findAll();
        $data['professores'] = $this->buscarProfessores();

        // Buscar o registro onde a coluna 'ativo' é 1 no periodoLetivoModel
        $data['periodoAtivo'] = $this->periodoLetivoModel->where('ativo', 1)->first();

SELECT *
FROM `disciplina`
ORDER BY `nome_disciplina` ASC
SELECT *
FROM `sala`
ORDER BY `nome_sala` ASC
SELECT *
FROM `periodo_letivo`
WHERE `ativo` = 1
 LIMIT 1
---
    public function horarioAulaPublico()
    {
        $data['disciplinas'] = $this->disciplinaModel->orderBy('nome_disciplina', 'ASC')->findAll();
        $data['salas'] = $this->salaModel->orderBy('nome_sala', 'ASC')->findAll();

        //retorna todos os professores
        $data['professores'] = $this->buscarProfessores();

        // Buscar o registro onde a coluna 'ativo' é 1 no periodoLetivoModel
        $data['periodoAtivo'] = $this->periodoLetivoModel->where('ativo', 1)->first();

DELETE FROM `horario_aula`
WHERE `id_horario_aula` = '20250328154233'
---
    public function deletarHorarioAula($idHorarioAula)
    {
        try {
            if ($this->horarioAulaModel->where('id_horario_aula', $idHorarioAula)->delete()) {

SELECT *
FROM `horario_aula`
WHERE `codigo_turma` = '098A'
AND `periodo_letivo` = '25.1'
SELECT *
FROM `disciplina`
WHERE `disciplina`.`id_disciplina` = '13'
SELECT *
FROM `sala`
WHERE `sala`.`id_sala` = '1'
---
    public function carregarHorarios($codigoTurma)
    {
        // Pesquisa os horários da turma apenas no período letivo ativo
        $pesquisaHorarios = $this->horarioAulaModel
            ->where('codigo_turma', $codigoTurma)
            ->where('periodo_letivo', $this->periodoLetivoModel->verificarPeriodoAtivo())
            ->findAll();

        $horarios = [];

        // Itera sobre os dados para formatar os eventos
        foreach ($pesquisaHorarios as $horario) {

            $disciplina = $this->disciplinaModel->find($horario['id_disciplina']);
            $professor = $this->buscarProfessor($horario['professor']);
            $sala = $this->salaModel->find($horario['id_sala']);

SELECT *
FROM `horario_aula`
WHERE `professor` = '42'
AND `periodo_letivo` = '25.1'
SELECT *
FROM `disciplina`
WHERE `disciplina`.`id_disciplina` = '30'
SELECT *
FROM `turma`
WHERE `turma`.`codigo_turma` = 'EAG24T'
SELECT *
FROM `sala`
WHERE `sala`.`id_sala` = '9'
---
    public function carregarHorariosProfessor($idProfessor)
    {
        $pesquisaHorarios = $this->horarioAulaModel
            ->where('professor', $idProfessor)
            ->where('periodo_letivo', $this->periodoLetivoModel->verificarPeriodoAtivo())
            ->findAll();

        $horarios = [];

        // Itera sobre os dados para formatar os eventos
        foreach ($pesquisaHorarios as $horario) {

            $disciplina = $this->disciplinaModel->find($horario['id_disciplina']);
            $turma = $this->turmaModel->find($horario['codigo_turma']);
            $sala = $this->salaModel->find($horario['id_sala']);

SELECT *
FROM `horario_aula`
WHERE `id_sala` = '3'
AND `periodo_letivo` = '25.1'
---
    public function carregarHorariosSala($idSala)
    {
        $pesquisaHorarios = $this->horarioAulaModel
            ->where('id_sala', $idSala)
            ->where('periodo_letivo', $this->periodoLetivoModel->verificarPeriodoAtivo())
            ->findAll();

SELECT *
FROM `horario_aula`
WHERE `periodo_letivo` = '25.1'
AND `id_horario_aula` != 0
AND   (
`id_sala` = 'Sem sala'
OR `professor` = 'Sem professor'
 )
---
    public function retornarConflitos()
    {
        // Recebe os dados enviados (certifique-se de que o Content-Type seja application/json)
        $evento = $this->request->getJSON(true);

        // Consulta o banco para pegar os horários ocupados
        $horariosOcupados = $this->horarioAulaModel
            ->where('periodo_letivo', $this->periodoLetivoModel->verificarPeriodoAtivo())
            ->where('id_horario_aula !=', $evento['idHorarioAula'])
            ->groupStart()
            ->where('id_sala', $evento['id_sala'])
            ->orWhere('professor', $evento['professor'])
            ->groupEnd()
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `horario_aula`
WHERE `professor` = '56'
AND `dia_semana` = 1
AND `periodo_letivo` = '25.1'
AND `id_horario_aula` != 0
AND   (
`horario_inicio` < 17
AND `horario_fim` > 13
 )
SELECT COUNT(*) AS `numrows`
FROM `horario_aula`
WHERE `id_sala` = '16'
AND `dia_semana` = 1
AND `periodo_letivo` = '25.1'
AND `id_horario_aula` != 0
AND   (
`horario_inicio` < 17
AND `horario_fim` > 13
 )
---
    public function verificarConflitos()
    {
        $evento = $this->request->getJSON(true);

        // Verifica conflitos de professor
        $conflitoProfessor = $this->horarioAulaModel
            ->where('professor', $evento['professor'])
            ->where('dia_semana', $evento['dia_semana'])
            ->where('periodo_letivo', $this->periodoLetivoModel->verificarPeriodoAtivo())
            ->where('id_horario_aula !=', $evento['id_horario_aula'])
            ->groupStart() // Agrupa as condições para verificar sobreposição de horário
            ->where('horario_inicio <', $evento['horario_fim'])
            ->where('horario_fim >', $evento['horario_inicio'])
            ->groupEnd()
            ->countAllResults();

        if ($conflitoProfessor > 0) {
            return $this->response->setJSON([
                'conflito' => true,
                'tipo' => 'professor',
                'mensagem' => 'O professor já possui um evento nesse horário.'
            ]);
        }

        // Verifica conflitos de sala
        $conflitoSala = $this->horarioAulaModel
            ->where('id_sala', $evento['id_sala'])
            ->where('dia_semana', $evento['dia_semana'])
            ->where('periodo_letivo', $this->periodoLetivoModel->verificarPeriodoAtivo())
            ->where('id_horario_aula !=', $evento['id_horario_aula'])
            ->groupStart() // Agrupa as condições para verificar sobreposição de horário
            ->where('horario_inicio <', $evento['horario_fim'])
            ->where('horario_fim >', $evento['horario_inicio'])
            ->groupEnd()
            ->countAllResults();