app/Controllers/HorarioAula.php

SELECT `horario_aula`.*, `turma`.*
FROM `horario_aula`
JOIN `turma` ON `turma`.`codigo_turma` = `horario_aula`.`codigo_turma`
---
    public function listaHorarioAula()
    {

        // Obtém os dados de horários de aula e as informações relacionadas às turmas, eliminando duplicatas
        $data['horarios_aulas'] = $this->horarioAulaModel
            ->distinct() // Garante que os resultados sejam distintos, eliminando duplicatas com base nos campos selecionados.
            ->select('horario_aula.*, turma.*') // Seleciona todas as colunas da tabela 'horario_aula' e 'turma'.
            ->join('turma', 'turma.codigo_turma = horario_aula.codigo_turma') // Realiza um JOIN entre 'horario_aula' e 'turma', relacionando pelo campo 'codigo_turma'.
            ->groupBy('horario_aula.id_horario_aula') // Agrupa os resultados pelo campo 'id_horario_aula', garantindo que cada ID apareça apenas uma vez.
            ->findAll();

SELECT *
FROM `horario_aula`
WHERE `professor` = '6'
SELECT *
FROM `disciplina`
WHERE `disciplina`.`id_disciplina` = '13'
SELECT *
FROM `turma`
WHERE `turma`.`codigo_turma` = '110A'
SELECT *
FROM `sala`
WHERE `sala`.`id_sala` = '1'
---
    public function carregarHorariosProfessor($idProfessor)
    {

        $pesquisaHorarios = $this->horarioAulaModel->where('professor', $idProfessor)->findAll();
        $horarios = [];



        // Itera sobre os dados para formatar os eventos
        foreach ($pesquisaHorarios as $horario) {

            $disciplina = $this->disciplinaModel->find($horario['id_disciplina']);
            $turma = $this->turmaModel->find($horario['codigo_turma']);
            $sala = $this->salaModel->find($horario['id_sala']);

SELECT *
FROM `horario_aula`
WHERE `id_sala` = 'default'
---
    public function carregarHorariosSala($idSala)
    {

        $pesquisaHorarios = $this->horarioAulaModel->where('id_sala', $idSala)->findAll();