app/Controllers/Turma.php

    public function listarTurma()
    {

        $data['turmas'] = $this->turmaModel->findAll();
---
SELECT *
FROM `turma`