app/Controllers/Usuario.php

SELECT *
FROM `usuario`
---
    public function buscarUsuario()
    {
        // Busca os dados dos usuários
        $dadosUsuarios = $this->usuarioModel->findAll();