app/Models/PeriodoLetivoModel.php

SELECT *
FROM `periodo_letivo`
WHERE `ativo` = 1
 LIMIT 1
---
    public function verificarPeriodoAtivo()
    {
        $periodo = $this->where('ativo', 1)->first();